app/controllers/api/v1/sessions_controller.rb

  def create
    if  User.find_by_email(params[:user][:email])
      render :json => { :success => true,
                       :info => "Logged in"}

    elsif  params[:user][:email].blank?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "admin@carmatec.com"]]
SELECT "users".* FROM "users"